espressif/esp-idf/components/soc/esp32s3/include/soc/sensitive_reg.h
#define SENSITIVE_EDMA_PMS_SPI3_REG          (DR_REG_SENSITIVE_BASE + 0x2C4)
/* SENSITIVE_EDMA_PMS_SPI3_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2_M  ((SENSITIVE_EDMA_PMS_SPI3_ATTR2_V)<<(SENSITIVE_EDMA_PMS_SPI3_ATTR2_S))
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_SPI3_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_SPI3_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1_M  ((SENSITIVE_EDMA_PMS_SPI3_ATTR1_V)<<(SENSITIVE_EDMA_PMS_SPI3_ATTR1_S))
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_SPI3_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2C8)
/* SENSITIVE_EDMA_PMS_UHCI0_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_UHCI0_LOCK_S  0

#define SENSITIVE_EDMA_PMS_UHCI0_REG          (DR_REG_SENSITIVE_BASE + 0x2CC)
/* SENSITIVE_EDMA_PMS_UHCI0_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2_M  ((SENSITIVE_EDMA_PMS_UHCI0_ATTR2_V)<<(SENSITIVE_EDMA_PMS_UHCI0_ATTR2_S))
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_UHCI0_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1_M  ((SENSITIVE_EDMA_PMS_UHCI0_ATTR1_V)<<(SENSITIVE_EDMA_PMS_UHCI0_ATTR1_S))
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_UHCI0_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_I2S0_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2D0)
/* SENSITIVE_EDMA_PMS_I2S0_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_I2S0_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_I2S0_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_I2S0_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_I2S0_LOCK_S  0

#define SENSITIVE_EDMA_PMS_I2S0_REG          (DR_REG_SENSITIVE_BASE + 0x2D4)
/* SENSITIVE_EDMA_PMS_I2S0_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2_M  ((SENSITIVE_EDMA_PMS_I2S0_ATTR2_V)<<(SENSITIVE_EDMA_PMS_I2S0_ATTR2_S))
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_I2S0_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_I2S0_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1_M  ((SENSITIVE_EDMA_PMS_I2S0_ATTR1_V)<<(SENSITIVE_EDMA_PMS_I2S0_ATTR1_S))
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_I2S0_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_I2S1_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2D8)
/* SENSITIVE_EDMA_PMS_I2S1_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_I2S1_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_I2S1_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_I2S1_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_I2S1_LOCK_S  0

#define SENSITIVE_EDMA_PMS_I2S1_REG          (DR_REG_SENSITIVE_BASE + 0x2DC)
/* SENSITIVE_EDMA_PMS_I2S1_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2_M  ((SENSITIVE_EDMA_PMS_I2S1_ATTR2_V)<<(SENSITIVE_EDMA_PMS_I2S1_ATTR2_S))
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_I2S1_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_I2S1_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1_M  ((SENSITIVE_EDMA_PMS_I2S1_ATTR1_V)<<(SENSITIVE_EDMA_PMS_I2S1_ATTR1_S))
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_I2S1_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2E0)
/* SENSITIVE_EDMA_PMS_LCD_CAM_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_LCD_CAM_LOCK_S  0

#define SENSITIVE_EDMA_PMS_LCD_CAM_REG          (DR_REG_SENSITIVE_BASE + 0x2E4)
/* SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_M  ((SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_V)<<(SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_S))
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_M  ((SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_V)<<(SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_S))
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_LCD_CAM_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_AES_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2E8)
/* SENSITIVE_EDMA_PMS_AES_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_AES_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_AES_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_AES_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_AES_LOCK_S  0

#define SENSITIVE_EDMA_PMS_AES_REG          (DR_REG_SENSITIVE_BASE + 0x2EC)
/* SENSITIVE_EDMA_PMS_AES_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_AES_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_AES_ATTR2_M  ((SENSITIVE_EDMA_PMS_AES_ATTR2_V)<<(SENSITIVE_EDMA_PMS_AES_ATTR2_S))
#define SENSITIVE_EDMA_PMS_AES_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_AES_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_AES_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_AES_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_AES_ATTR1_M  ((SENSITIVE_EDMA_PMS_AES_ATTR1_V)<<(SENSITIVE_EDMA_PMS_AES_ATTR1_S))
#define SENSITIVE_EDMA_PMS_AES_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_AES_ATTR1_S  0

