espressif/esp-idf/components/soc/esp32s3/include/soc/sensitive_reg.h
#define SENSITIVE_EDMA_PMS_SHA_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2F0)
/* SENSITIVE_EDMA_PMS_SHA_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_SHA_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_SHA_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_SHA_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_SHA_LOCK_S  0

#define SENSITIVE_EDMA_PMS_SHA_REG          (DR_REG_SENSITIVE_BASE + 0x2F4)
/* SENSITIVE_EDMA_PMS_SHA_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_SHA_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_SHA_ATTR2_M  ((SENSITIVE_EDMA_PMS_SHA_ATTR2_V)<<(SENSITIVE_EDMA_PMS_SHA_ATTR2_S))
#define SENSITIVE_EDMA_PMS_SHA_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_SHA_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_SHA_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_SHA_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_SHA_ATTR1_M  ((SENSITIVE_EDMA_PMS_SHA_ATTR1_V)<<(SENSITIVE_EDMA_PMS_SHA_ATTR1_S))
#define SENSITIVE_EDMA_PMS_SHA_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_SHA_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x2F8)
/* SENSITIVE_EDMA_PMS_ADC_DAC_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_ADC_DAC_LOCK_S  0

#define SENSITIVE_EDMA_PMS_ADC_DAC_REG          (DR_REG_SENSITIVE_BASE + 0x2FC)
/* SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_M  ((SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_V)<<(SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_S))
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_M  ((SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_V)<<(SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_S))
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_ADC_DAC_ATTR1_S  0

#define SENSITIVE_EDMA_PMS_RMT_LOCK_REG          (DR_REG_SENSITIVE_BASE + 0x300)
/* SENSITIVE_EDMA_PMS_RMT_LOCK : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_RMT_LOCK    (BIT(0))
#define SENSITIVE_EDMA_PMS_RMT_LOCK_M  (BIT(0))
#define SENSITIVE_EDMA_PMS_RMT_LOCK_V  0x1
#define SENSITIVE_EDMA_PMS_RMT_LOCK_S  0

#define SENSITIVE_EDMA_PMS_RMT_REG          (DR_REG_SENSITIVE_BASE + 0x304)
/* SENSITIVE_EDMA_PMS_RMT_ATTR2 : R/W ;bitpos:[3:2] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_RMT_ATTR2    0x00000003
#define SENSITIVE_EDMA_PMS_RMT_ATTR2_M  ((SENSITIVE_EDMA_PMS_RMT_ATTR2_V)<<(SENSITIVE_EDMA_PMS_RMT_ATTR2_S))
#define SENSITIVE_EDMA_PMS_RMT_ATTR2_V  0x3
#define SENSITIVE_EDMA_PMS_RMT_ATTR2_S  2
/* SENSITIVE_EDMA_PMS_RMT_ATTR1 : R/W ;bitpos:[1:0] ;default: 2'b11 ; */
/*description: .*/
#define SENSITIVE_EDMA_PMS_RMT_ATTR1    0x00000003
#define SENSITIVE_EDMA_PMS_RMT_ATTR1_M  ((SENSITIVE_EDMA_PMS_RMT_ATTR1_V)<<(SENSITIVE_EDMA_PMS_RMT_ATTR1_S))
#define SENSITIVE_EDMA_PMS_RMT_ATTR1_V  0x3
#define SENSITIVE_EDMA_PMS_RMT_ATTR1_S  0

#define SENSITIVE_CLOCK_GATE_REG          (DR_REG_SENSITIVE_BASE + 0x308)
/* SENSITIVE_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SENSITIVE_CLK_EN    (BIT(0))
#define SENSITIVE_CLK_EN_M  (BIT(0))
#define SENSITIVE_CLK_EN_V  0x1
#define SENSITIVE_CLK_EN_S  0

#define SENSITIVE_RTC_PMS_REG          (DR_REG_SENSITIVE_BASE + 0x30C)
/* SENSITIVE_DIS_RTC_CPU : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENSITIVE_DIS_RTC_CPU    (BIT(0))
#define SENSITIVE_DIS_RTC_CPU_M  (BIT(0))
#define SENSITIVE_DIS_RTC_CPU_V  0x1
#define SENSITIVE_DIS_RTC_CPU_S  0

#define SENSITIVE_DATE_REG          (DR_REG_SENSITIVE_BASE + 0xFFC)
/* SENSITIVE_DATE : R/W ;bitpos:[27:0] ;default: 28'h2101180 ; */
/*description: .*/
#define SENSITIVE_DATE    0x0FFFFFFF
#define SENSITIVE_DATE_M  ((SENSITIVE_DATE_V)<<(SENSITIVE_DATE_S))
#define SENSITIVE_DATE_V  0xFFFFFFF
#define SENSITIVE_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_SENSITIVE_REG_H_ */
